{"pageProps":{"item":{"id":"reddit-shadowbanned","contentHtml":"<p><strong>TL;DR</strong>: I submitted a post to r/MacApps, then my Reddit account (<a href=\"https://www.reddit.com/user/mshibanami/\">u/mshibanami</a>) was locked. Roughly 10 hours later, my account was shifted to a shadowbanned state. Due to this status, all my posts were automatically filtered out. I have waited for 3 months now, but Reddit didn't take any more actions. So I gave up this account.</p>\n<h2>Summary</h2>\n<p>In August 2025, I released a new version of my app called <a href=\"https://mshibanami.github.io/redirect-web/\">Redirect Web</a>, and posted it in <a href=\"https://www.reddit.com/r/macapps/\">r/macapps</a> as a self-promotion since it was allowed according to their rules. After that, my account was locked by Reddit, and all my posts were automatically hidden.</p>\n<p>I wrote this article to document what happened, ensuring transparency regarding myself and my work. I hope this record helps others who encounter the same issue, even though I was unable to resolve it myself.</p>\n<h2>Posts affected</h2>\n<p>All of my comments, and my posts (which were just the following two):</p>\n<ul>\n<li>[Aug 2025] <a href=\"https://www.reddit.com/r/macapps/comments/1mzpxlk/\">[Big Update] Redirect Web 8 - now supports multiple browsers, not just Safari!</a></li>\n<li>[Aug 2024] <a href=\"https://www.reddit.com/r/macapps/comments/1ejqelt/\">I made a Safari extension for macOS &#x26; iOS called Redirect Web, which allows you to redirect any web page to another</a></li>\n</ul>\n<h2>Timeline</h2>\n<ul>\n<li><strong>25 Aug at 1:04 AM (UTC)</strong>\n<ul>\n<li>I posted on <a href=\"https://www.reddit.com/r/macapps/\">r/MacApps</a> for announcing <a href=\"https://mshibanami.github.io/redirect-web/release-notes/8.0.0\">Redirect Web's update</a>, and I was replying to the Redditors until my account was locked.</li>\n</ul>\n</li>\n<li><strong>25 Aug at 7:21 PM (UTC)</strong>\n<ul>\n<li>My account was locked by Reddit.</li>\n<li>All of my posts were also removed with this message: <code>Sorry, this post was removed by Reddit’s filters.</code></li>\n<li>I received the account lock email and reset my password as instructed, but my account remained restricted.</li>\n<li>I sent an appeal to Reddit via <a href=\"https://www.reddit.com/appeals\">https://www.reddit.com/appeals</a>.</li>\n</ul>\n</li>\n<li><strong>~10 hours later</strong>\n<ul>\n<li>My account was <strong>placed under a shadowban</strong> by Reddit,\n<ul>\n<li>At this time, I mistakenly thought it had been fully reinstated.</li>\n</ul>\n</li>\n<li>My posts still didn't appear publicly, so I sent a message to r/MacApps mods through <a href=\"https://www.reddit.com/message/compose?to=r/macapps\">Modmail</a> to restore them.</li>\n</ul>\n</li>\n<li><strong>26 Aug at 8:58PM (UTC)</strong>\n<ul>\n<li>r/MacApps Mod Team <a href=\"https://www.reddit.com/r/macapps/comments/1mzpxlk/comment/nau0ur1/\">posted</a> a comment: \"Poster's account suspended by Reddit.\"</li>\n<li>The error message <code>Sorry, this post was removed by Reddit’s filters.</code> was also replaced with <code>Sorry, this post has been removed by the moderators of r/macapps.</code></li>\n</ul>\n</li>\n<li><strong>27 Aug</strong>\n<ul>\n<li>I contacted mods via Modmail again, and they replied to me that they couldn't restore my posts because I'm shadowbanned.</li>\n</ul>\n</li>\n<li><strong>30 Nov</strong>\n<ul>\n<li>I confirmed my account is still shadowbanned. I gave up my account.</li>\n</ul>\n</li>\n</ul>\n<h2>Why did Reddit do it?</h2>\n<p>I'm not too sure, but I assume these could have triggered Reddit filters:</p>\n<ul>\n<li>The last activity of my account was <a href=\"https://www.reddit.com/r/Safari/comments/1jp5scj/comment/mkxlbuw/\">5 months ago</a>, and I suddenly posted a self-promotion post and actively replied to other users.</li>\n<li>I was using NordVPN. (Australian server, where I also live.)</li>\n<li>I was accessing Reddit using Firefox Nightly without any extensions.</li>\n<li>I was on Reddit overnight.</li>\n</ul>\n<h2>Impact</h2>\n<p>Since my account was shadowbanned, other users can no longer read my posts. They are also gone from Google Search, which is a major loss in acquiring new users.</p>\n<ul>\n<li><a href=\"https://www.reddit.com/r/macapps/comments/1ejqelt/\">My older post</a> still has its title and my replies to other comments since its status is still <code>Sorry, this post was removed by Reddit’s filters.</code>.</li>\n<li><a href=\"https://www.reddit.com/r/macapps/comments/1mzpxlk/\">My newer post</a>'s title is <em>[ Removed by moderator ]</em> and all my comments are hidden for other users, not even showing <em>Comment removed by moderator.</em> It's completely invisible for other users while I can still see it using my u/mshibanami account.</li>\n</ul>\n<h2>Could mods have restored the post?</h2>\n<p>I don't think so, although I'm not 100% sure.</p>\n<p>After reading <a href=\"https://support.reddithelp.com/hc/en-us/articles/15484365010196-Mod-Mode\">Reddit's documentation</a>, I thought mods should have been able to approve my post manually. In fact, when they <a href=\"https://www.reddit.com/r/macapps/comments/1mzpxlk/comment/nau0ur1/\">posted a comment</a>, the status of my post was also changed to \"Sorry, this post has been removed by the moderators of r/MacApps.\" from \"<br>\nSorry, this post was removed by Reddit’s filters.\" However, since my account was shadownbanned, they probably couldn't do it. At least that's what they explained to me via Modmail.</p>\n<p>However, I have no experience as a mod and I couldn't find any official documentation about this specific situation. If you have more information, please let me know.</p>\n<h2>Appendix</h2>\n<h3>Email from Reddit (<code>noreply@redditmail.com</code>)</h3>\n<blockquote>\n<p>Hi u/mshibanami,</p>\n<p>At Reddit, we're always watching out for your privacy, safety, and security. Recently, after detecting some technical irregularities on your u/mshibanami account, we took the extra precaution of locking your account.</p>\n<p>To unlock your account, reset your password now.</p>\n<p>We recommend choosing a new password that you haven't used on Reddit or another website or app before.</p>\n<p>To prevent your account from potential misuse, you won't be able to take part in communities or update the majority of your settings while your account is locked. Also, when you log in you'll see a red warning and a security message like this one asking you to reset your password.</p>\n</blockquote>\n<h3>Reply from r/MacApps Mod Team via Modmail</h3>\n<blockquote>\n<p>r/macapps MOD 2:03 AM\nThanks for reaching out</p>\n<p>• Your account appears to have been suspended: Your account is site-wide shadow banned.</p>\n<p>• This means that only mods of individual subreddits can see your content. You need to contact the admins to get it sorted out.</p>\n<p>• Appeals can be made here: <a href=\"https://www.reddit.com/appeals\">https://www.reddit.com/appeals</a></p>\n</blockquote>\n<blockquote>\n<p>Your account is still suspended. Sorry</p>\n</blockquote>\n","textFormat":0,"sourceFileAbsolutePath":"/home/runner/work/website/website/blog/reddit-shadowbanned.md","outputPath":"blog/reddit-shadowbanned","title":"My Reddit account was locked, and then shadowbanned.","createdAt":"2025-11-30","language":"en"}},"__N_SSG":true}